#include <stdio.h>
int main(){
    printf("加上.和要顯示第幾位，設定四捨五入:%.2f\n",16.1666);
    printf("加上.和要顯示第幾位:%.2s\n","AAA");
    printf("加上數字，預留字元有少就補空格:%3d\n",16);//預留３個字元
    printf("加上數字，預留字元有少就補空格:%10f\n",16.16);//預留10個字元
    printf("加上數字，預留字元有少就補空格:%2c\n",'A');//預留2個字元
    printf("加上數字，預留字元有少就補空格:%3s\n","AA");//預留3個字元
    printf("加上0和數字，預留字元有少就補0:%03d\n",16);
    printf("加上*，預留字元有少就補空格:%*d\n",3,16);
    printf("加上*，預留字元有少就補空格:%*d|%*d\n",3,16,3,16);
    printf("加上負號，在預留字元範圍內靠左對齊:%-3d\n",16);
    printf("加上+，顯示正負號:%+3d\n",16);
    printf("加上空格，在前面加上空格:% d\n",16);
    printf("加上#，在x、o前面加上0x非0值情況時:%#x\n",16);
    return 0;
}